""" Задача 32: Определить индексы элементов массива (списка), значения которых 
принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше 
заданного максимума) 
Ввод: [-5, 9, 0, 3, -1, -2, 1,
4, -2, 10, 2, 0, -9, 8, 10, -9,
0, -5, -5, 7]
7,10
Вывод: [1, 9, 13, 14, 19]"""

list_set=[-5, 9, 0, 3, -1, -2, 1,4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

a = int(input("Enter min: "))
b = int(input("Enter max: "))
list_res=list()
for i in range(len(list_set)):
    if list_set[i] >= a  <= b:
        list_res.append(i)
print(list_res)